import jieba
import jieba.analyse as analyse
def process_text(text_list):
    '''
   产生分词数据 实现分词   对福利分词
    '''
    # 去除None项
    text_list = [text for text in text_list if text is not None]
    
    # 分词处理
    result = []
    for text in text_list:
        seg_list = text.split('，')
        seg_list = [seg for seg in seg_list if seg.strip()]
        result.append(seg_list)
    txt=''
    for t in result:
       text=" ".join(t)
       txt+=text
    return txt

def save_text(text):
    with open('reward.txt', 'a+', encoding='utf-8') as targetFile:
        targetFile.write(text)
        targetFile.write('\n')
        print('写入成功')


def get_HZ(text='reward.txt'):
    '''
    词频 统计 如('五险一金定期体检', 1), ('有无线网', 1)
    '''
    
    
    with open('reward.txt', 'r', encoding='utf8') as f:
        text = f.read()
        new_text=text.split(' ')
        print(new_text)
        word_count= {}
        for i in set(new_text):
         word_count[i] = new_text.count(i)
        #格式整理
    list_count = sorted(word_count.items(), key=lambda x: x[1], reverse=True)
    return list_count

if __name__ == '__main__':
    # 示例用法
    text_list = ['餐补，交通补助，年终奖，健康福利金，带薪年假，定期体检，重疾及意外险，通讯补贴，五险一金，过节费，补充医疗保险，节日福利', '带薪年假，团建聚餐，年终奖，五险一金，定期体检，交通补\
    助，免费班车，节日福利', '福利待遇', '餐补，交通补助，年终奖，健康福利金，带薪年假，定期体检，重疾及意外险，通讯补贴，五险一金，过节费，补充医疗保险，节日福利', '带薪年假，团建聚餐 ，年终奖，五险一金，定期体检，交通补助，免费班车，节日福利', None, None, '五险一金，年终奖，带薪年假', '底薪加提成，团建聚餐，通讯补贴，零食下午茶，免费工装，带薪年假，年终奖，节日 福利，交通补助，股票期权，餐补，生日福利，保底工资，员工旅游，绩效奖金，意外险，补充医疗保险，五险一金', None, '定期体检，年终奖，通讯补贴，五险一金，加班补助，带薪年假，节日福利', None, None, '生日福利，团建聚餐，节日福利，有无线网，零食下午茶', None, '补充医疗保险，年终奖，住房补贴，五险一金，交通补助，定期体检，企业年金，通讯补贴，节日福利，餐补，零食下午茶，带薪年假', '年终奖，定期体检，员工旅游，全勤奖，交通补助，餐补，零食下午茶，节日福利，五险一金，住房补贴，培训体系', '零食下午茶，足额五险一金，食堂，餐补，节日福利，生日福利，免 费工装，定期体检，带薪年假，节假日加班费，法定节假日三薪，通讯补贴，五险一金，交通补助，年终奖，补充医疗保险', None, '带薪年假，免费班车，补充医疗保险，年终奖，股票期权，绩效奖金， 节日福利，交通补助，餐补，通讯补贴，五险一金，零食下午茶，员工旅游，住房补贴，包吃，定期体检', '加班补助，通讯补贴，年终奖，员工旅游，定期体检，五险一金，节日福利，带薪年假', '全勤 奖，五险一金，定期体检，带薪年假，股票期权，交通补助，年终奖，节日福利，零食下午茶', '餐补，节日福利，零食下午茶，包吃，五险一金，通讯补贴，全勤奖，年终奖，交通补助，加班补助，定期 体检，员工旅游，股票期权', '五险一金，免费班车，加班补助，带薪年假，定期体检，年终奖，节假日加班费，节日福利', '补充医疗保险，带薪年假，零食下午茶，定期体检，员工旅游，五险一金，股 票期权，节日福利，交通补助，餐补，通讯补贴，免费班车，年终奖', '五险一金，定期体检，餐补，带薪年假，交通补助，通讯补贴，年终奖，节日福利', None, '五险一金，节日福利，年终奖，定期体 检，股票期权，带薪年假，餐补，交通补助，员工旅游，补充医疗保险，零食下午茶', '带薪年假，年终奖，节日福利，通讯补贴，五险一金', None, '五险一金', '节日福利，员工旅游，带薪年假，全勤 奖，五险一金', '五险一金，补充医疗保险，定期体检', '五险一金，年终奖，包吃，交通补助，股票期权，零食下午茶，补充医疗保险，员工旅游，全勤奖，住房补贴，免费班车，节日福利，定期体检， 带薪年假，通讯补贴', '五险一金，定期体检，餐补，年终奖，带薪年假，节日福利，零食下午茶，交通补助，通讯补贴，生日福利，绩效奖金', '员工旅游，带薪年假，节日福利，零食下午茶，补充医疗 保险，年终奖，通讯补贴，篮球赛、运动，股票期权，五险一金', '通讯补贴，加班补助，零食下午茶，五险一金，带薪年假，员工旅游，餐补，年终奖，节日福利，定期体检', '五险一金，加班补助', ' 带薪年假，补充医疗保险，五险一金', '餐补，股票期权，零食下午茶，通讯补贴，五险一金，年终奖，带薪年假，定期体检，员工旅游', '五险一金', '绩效奖金，年终奖，通讯补贴，补充医疗保险，有 无线网，定期体检，意外险，餐补，团建聚餐，五险一金，交通补助，带薪年假，节日福利，法定节假日三薪', '年终奖，节日福利，五险一金，带薪年假，定期体检，股票期权，补充医疗保险，餐补，12%公积金', '五险一金，年终奖，零食下午茶', '福利待遇', '福利待遇', '福利待遇', '福利待遇', '福利待遇', '福利待遇', '福利待遇', '福利待遇']
    print(get_HZ())
    #processed_text  = process_text(text_list)
    #print(processed_text)
    #save_text(processed_text)
    '''
    效果
    ['绩效奖金', '，', '年终奖', '，', '通讯', '补贴', '，', '补充', '医疗保险', '，', '有', '无线网', '，', '定期', '体检', '，', '意外险', '，', '餐补', '，', '团建', '聚餐', '，', ' 五险', '一金', '，', '交通', '补助', '，', '带薪', '年', '假', '，', '节日', '福利', '，', '法定', '节假日', '三薪']
    '''
